<?php
defined('BASE_PATH') OR exit('No direct script access allowed');

//http://gmp.rozblog.com/post/213
if (!function_exists('bank_name')) {
    function bank_name($cardNumber)
    {
        $bankNames = [
            'بانک ملی ایران' => [
                '603799',
            ],
            'بانک سپه' => [
                '589210',
            ],
            'بانک توسعه صادرات' => [
                '627648',
                '207177',
            ],
            'بانک صنعت و معدن' => [
                '627961',
            ],
            'بانک کشاورزی' => [
                '603770',
                '639217',
            ],
            'بانک مسکن' => [
                '628023',
            ],
            'پست بانک ایران' => [
                '627760',
            ],
            'بانک توسعه تعاون' => [
                '502908',
            ],
            'بانک اقتصاد نوین' => [
                '627412',
            ],
            'بانک پارسیان' => [
                '622106',
                '639194',
                '627884',
            ],
            'بانک پاسارگاد' => [
                '639347',
                '502229',
            ],
            'بانک کارآفرین' => [
                '627488',
                '502910',
            ],
            'بانک سامان' => [
                '621986',
            ],
            'بانک سینا' => [
                '639346',
            ],
            'بانک سرمایه' => [
                '639607',
            ],
            'بانک تات' => [
                '636214',
            ],
            'بانک شهر' => [
                '502806',
                '504706',
            ],
            'بانک دی' => [
                '502938',
            ],
            'بانک صادرات' => [
                '603769',
            ],
            'بانک ملت' => [
                '610433',
                '991975',
            ],
            'بانک تجارت' => [
                '627353',
            ],
            'بانک رفاه' => [
                '589463',
            ],
            'بانک انصار' => [
                '627381',
            ],
            'بانک ایران زمین' => [
                '505785',
            ],
            'بانک مرکزی' => [
                '636795',
            ],
            'بانک حکمت ایرانیان' => [
                '636949',
            ],
            'بانک گردشگری' => [
                '505416',
            ],
            'بانک قرض الحسنه مهر ایران' => [
                '606373',
            ],
            'مؤسسه اعتباری توسعه' => [
                '628157',
            ],
            'مؤسسه مالی اعتباری کوثر' => [
                '505801',
            ],
            'مؤسسه مالی اعتباری مهر' => [
                '639370',
            ],
            'بانک قوامین' => [
                '639599',
            ],
        ];

        $cardNumber = convertNumbersToPersian($cardNumber, true);
        $checkCardNumber = substr($cardNumber, 0, 6);
        if (!is_numeric($checkCardNumber) || mb_strlen($checkCardNumber) != 6) {
            return 'نامشخص';
        }
        foreach ($bankNames as $name => $cardNumArr) {
            foreach ($cardNumArr as $cardNum) {
                if ($cardNum == $checkCardNumber) {
                    return $name;
                }
            }
        }
        return 'نامشخص';
    }
}
